In [1]:
import pandas as pd

In [2]:
dict = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
df = pd.DataFrame(dict)
df

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
age      4 non-null int64
heigh    4 non-null int64
name     4 non-null object
dtypes: int64(2), object(1)
memory usage: 168.0+ bytes

In [4]:
df.describe()

             age       heigh
count   4.000000    4.000000
mean   46.000000  174.500000
std    20.049938   10.847427
min    23.000000  165.000000
25%    35.750000  168.750000
50%    45.000000  171.500000
75%    55.250000  177.250000
max    71.000000  190.000000

In [5]:
df.age

0    23
1    40
2    50
3    71
Name: age, dtype: int64

In [6]:
df["heigh"]

0    170
1    173
2    165
3    190
Name: heigh, dtype: int64

In [8]:
df.columns

Index([u'age', u'heigh', u'name'], dtype='object')

# Similarities To Python Dictionaries

In [9]:
df

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [10]:
df["score"] = pd.Series([67,77,80,90])

In [11]:
df

   age  heigh  name  score
0   23    170  lily     67
1   40    173  lucy     77
2   50    165  paul     80
3   71    190   sun     90

In [12]:
df["birthplace"] = "china" #broadcast

In [13]:
df

   age  heigh  name  score birthplace
0   23    170  lily     67      china
1   40    173  lucy     77      china
2   50    165  paul     80      china
3   71    190   sun     90      china

In [14]:
df["dummy"] = [1,2,3,4]

In [15]:
df

   age  heigh  name  score birthplace  dummy
0   23    170  lily     67      china      1
1   40    173  lucy     77      china      2
2   50    165  paul     80      china      3
3   71    190   sun     90      china      4

In [17]:
df[["age","score"]]

   age  score
0   23     67
1   40     77
2   50     80
3   71     90

In [18]:
del df["dummy"]

In [19]:
df

   age  heigh  name  score birthplace
0   23    170  lily     67      china
1   40    173  lucy     77      china
2   50    165  paul     80      china
3   71    190   sun     90      china

In [20]:
df.pop("score")

0    67
1    77
2    80
3    90
Name: score, dtype: int64

In [21]:
df

   age  heigh  name birthplace
0   23    170  lily      china
1   40    173  lucy      china
2   50    165  paul      china
3   71    190   sun      china

# Creation From Lists And Dicts

In [23]:
rows = [{"name":"lily", "age":20, "heigh":170},
       {"name":"lucy", "age":32, "heigh":171},
       {"name":"sun", "age":71, "heigh":165},
       {"name":"paul", "age":63, "heigh":168}]

In [24]:
pd.DataFrame(rows)

   age  heigh  name
0   20    170  lily
1   32    171  lucy
2   71    165   sun
3   63    168  paul

In [25]:
import json

In [27]:
json_output = json.dumps(dict)

In [28]:
pd.read_json(json_output)

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [29]:
json_output_rows = json.dumps(rows)
pd.read_json(json_output_rows)

   age  heigh  name
0   20    170  lily
1   32    171  lucy
2   71    165   sun
3   63    168  paul